{
  "avatar": {
    "fullName": "Camila Balsemao",
    "role": "Web Developer"
  },

  "profile": {
    "title": "Profile",
    "description": "Web developer with experience in frontend development using React and knowledge of backend technologies. Thanks to my background in cognitive research, I’m used to working in diverse teams and approaching problems from different perspectives. This has strengthened my analytical thinking and attention to detail. My experience as a QA tester helped me develop clear communication, prioritize tasks effectively, and focus on software quality. I’m eager to keep growing and contribute to projects with care and responsibility."
  },

  "skills": {
    "title": "Skills"
  },

  "languages": {
    "title": "Languages",
    "info": [
      {
        "name": "Spanish",
        "level": "Native"
      },
      {
        "name": "English",
        "level": "Intermediate"
      },
      {
        "name": "Italian",
        "level": "Basic"
      }
    ]
  },

  "contact": {
    "title": "Contact",
    "location": "Milan, Italy",
    "email": "cbalsemaod@gmail.com",
    "phone": "+39 351 480 5611"
  },

  "experience": {
    "title": "Work Experience",
    "info": [
      {
        "role": "Frontend Developer",
        "company": "Freelance",
        "date": "2024 - Present",
        "description": [
          "In the past year, I’ve been focused on learning and building websites independently. I’ve handled the full process—from gathering requirements to design, development, and deployment. The sites I built were simple but functional, responsive, user-friendly, and designed with a mobile-first and multilingual approach. I used React with Material UI for the frontend, and GoDaddy for hosting. I worked with two clients in Spain: one for a laundry service website, and another for a restaurant. Meanwhile, I’m also deepening my skills in backend technologies like Express and MongoDB to grow into a more complete full-stack web developer."
        ]
      },
      {
        "role": "QA Analyst / L2 Technical Support",
        "company": "Sisteco S.A.",
        "date": "March 2023 - June 2024",
        "description": [
          "In this role, I was responsible for gathering client requirements and performing functional analysis. I also took part in user acceptance testing. I provided remote support for client systems using Putty and designed graphical interfaces for totems and checkout systems with Xara. I used the MySQL database to run tests and troubleshoot technical issues. To manage test cases and documentation, I worked with TestLink, while Mantis Bug Tracker was used to report bugs and issues. After some time, I became responsible for onboarding new team members, helping them integrate into the team and understand the company’s workflows. We used Slack as our main tool for team communication and coordination."
        ]
      },
      {
        "role": "QA Tester",
        "company": "CES (Centro de Ensayos de Software)",
        "date": "December 2021 - March 2023",
        "description": [
          "I worked on a project focused on the management of Uruguay’s electoral system and the testing of several web pages with specific accessibility requirements. During this experience, I was responsible for designing and executing functional and regression tests. To ensure accessibility, I used tools like axe DevTools and NVDA (Non-Visual Desktop Access). I also worked with Mantis Bug Tracker and Selenium IDE."
        ]
      },
      {
        "role": "QA Tester",
        "company": "Tensai - Internship",
        "date": "August 2021- December 2021",

        "description": [
          "In this company, I worked on a mobile application for real-time truck tracking using GPS technologies, as well as on a website for a shopping mall. I was responsible for performing various types of tests, including functional, regression, usability, and responsiveness tests, using Responsively App. For each test, I produced the corresponding documentation and wrote reports on any issues using Mantis Bug Tracker. I also created progress reports for the tests and presented the results to the development team. Communication and task tracking were done through Trello, using the Kanboard methodology."
        ]
      }
    ]
  },

  "education": {
    "title": "Education",
    "info": [
      {
        "degree": "Computer Science",
        "school": "UdelaR (FING) - CETP",
        "date": "2022",
        "info": [
          {
            "description": [
              "I have worked on several projects, and the one I am most proud of is a DBMS made in C for the Algorithms and Data Structures course."
            ]
          }
        ]
      },

      {
        "degree": "Psychology",
        "school": "UdelaR - Psychology Faculty",
        "date": "2014",
        "info": [
          {
            "title": "Future-Oriented Thinking Measurement (2019)",
            "description": [
              "I participated in a long-term research project focused on how people’s time perspective affects their eating habits. I was actively involved in fieldwork, including recruiting and following up with participants, administering tests, analyzing data with SPSS, and presenting the results to the project leader."
            ]
          },
          {
            "title": "Psychosocial Intervention Using Chess (2020)",
            "description": [
              "I worked with an interdisciplinary team in a cognitive stimulation program using chess to help adolescents with Autism Spectrum Disorder (ASD) develop cognitive and social skills. My tasks included field observation, recording interactions, assessing behavioral impact, and writing technical reports."
            ]
          },
          {
            "title": "Statistical Analysis of Mathematical Equality in Children (2021)",
            "description": [
              " I took part in a research project studying how children aged 6 to 11 understand mathematical equality (sample: 221 participants). My tasks included designing experimental protocols, administering tests, analyzing data with SPSS, and writing the final research report."
            ]
          }
        ]
      }
    ]
  }
}
