{
  "avatar": {
    "fullName": "Camila Balsemao",
    "role": "Frontend Developer"
  },

  "profile": {
    "title": "Profile",
    "description": "I am a frontend developer with a strong foundation in software testing, which has honed my attention to detail and commitment to delivering high-quality applications. My expertise lies in building dynamic, user-friendly interfaces with React, focusing on functionality, performance, and seamless user experiences. I approach challenges with curiosity and a practical mindset, collaborating effectively with teams to develop solutions that improve both user satisfaction and application performance."
  },

  "skills": {
    "title": "Skills"
  },

  "languages": {
    "title": "Languages",
    "info": [
      {
        "name": "Spanish",
        "level": "Native"
      },
      {
        "name": "English",
        "level": "Fluent"
      },
      {
        "name": "Italian",
        "level": "Basic"
      }
    ]
  },

  "contact": {
    "title": "Contact",
    "location": "Milan, Italy",
    "email": "cbalsemaod@gmail.com",
    "phone": "+39 351 480 5611"
  },

  "experience": {
    "title": "Work Experience",
    "info": [
      {
        "role": "Frontend Developer",
        "company": "Freelance",
        "date": "2024 - Present",
        "projects": [
          {
            "name": "Clover Laundry",
            "date": "2024",
            "description": [
              "Developed a clean and user-friendly front-end interface using React and Material UI, tailored to the needs of a laundry business.",
              "Enhanced code reliability and maintainability by leveraging TypeScript for static typing and improved debugging.",
              "Designed a fully responsive layout, ensuring seamless usability across desktop, tablet, and mobile devices.",
              "Collaborated with the client to understand requirements and deliver a polished, functional web application."
            ]
          }
        ]
      },
      {
        "role": "QA Analyst / L2 Technical Support",
        "company": "Sisteco S.A.",
        "date": "March 2023 - June 2024",
        "description": [
          "Resolved client-reported technical issues using the Linux terminal, SSH, and database queries.",
          "Performed functional, regression, and database testing for retail systems.",
          "Created test cases, prepared test reports, and communicated software releases to clients.",
          "Trained and mentored new testers to ensure efficient onboarding and performance."
        ]
      },
      {
        "role": "QA Tester",
        "company": "CES (Centro de Ensayos de Software) - Internship",
        "date": "December 2021 - March 2022",
        "description": [
          "Created and maintained comprehensive test documentation.",
          "Conducted regression testing and reported incidents.",
          "Tested mobile and web applications to ensure functionality and usability.",
          "Utilized Mantis Bug Tracker to track and manage issues effectively.",
          "Collaborated with developers to ensure timely resolution of defects.",
          "Designed business-aligned test cases."
        ]
      },
      {
        "role": "QA Tester",
        "company": "Tensai (internship)",
        "date": "August 2021- December 2021",
        "description": [
          "Developed and executed functional test cases for mobile and web apps, performing detailed testing to ensure high quality and optimal user experience.",
          "Skilled in using Mantis Bug Tracker for effective bug tracking and resolution."
        ]
      }
    ]
  },

  "education": {
    "title": "Education"
  }
}
