{
  "avatar": {
    "fullName": "Camila Balsemao",
    "role": "Frontend Developer"
  },

  "profile": {
    "title": "Profile",
    "description": "I am a frontend developer with a strong foundation in software testing, which has honed my attention to detail and commitment to delivering high-quality applications. My expertise lies in building dynamic, user-friendly interfaces with React, focusing on functionality, performance, and seamless user experiences."
  },

  "skills": {
    "title": "Skills"
  },

  "languages": {
    "title": "Languages",
    "info": [
      {
        "name": "Spanish",
        "level": "Native"
      },
      {
        "name": "English",
        "level": "Intermediate"
      },
      {
        "name": "Italian",
        "level": "Basic"
      }
    ]
  },

  "contact": {
    "title": "Contact",
    "location": "Milan, Italy",
    "email": "cbalsemaod@gmail.com",
    "phone": "+39 351 480 5611"
  },

  "experience": {
    "title": "Work Experience",
    "info": [
      {
        "role": "Frontend Developer",
        "company": "Freelance",
        "date": "2024 - Present",
        "projects": [
          {
            "name": "Clover Laundry",
            "date": "2024",
            "description": [
              "Developed a clean and user-friendly front-end interface using React and Material UI, tailored to the needs of a laundry business."
            ]
          },
          {
            "name": "Rosemary restaurant",
            "date": "2024",
            "description": [
              "Developed a user-friendly front-end interface for a restaurant using React. Implemented TypeScript to enhance code reliability and maintainability. Designed a fully responsive layout to optimize usability across all devices."
            ]
          }
        ]
      },
      {
        "role": "QA Analyst / L2 Technical Support",
        "company": "Sisteco S.A.",
        "date": "March 2023 - June 2024",
        "description": [
          "Resolved client-reported technical issues using the Linux terminal, SSH and SQL queries to solve problems.",
          "Performed functional, regression, and database testing for retail systems.",
          "Performed functional, regression, and database testing for retail systems, utilizing TestLink for test case management and Mantis Bug Tracker for issue tracking.",
          " Created test cases, prepared test reports, and communicated software releases to clients. Trained and mentored new testers to ensure efficient onboarding and performance."
        ]
      },
      {
        "role": "QA Tester",
        "company": "CES (Centro de Ensayos de Software)",
        "date": "December 2021 - March 2023",
        "description": [
          "Collaborated within a team on a project for a major public organization in Uruguay, creating and maintaining comprehensive test documentation, designing business-aligned test cases, and conducting functional, regression, and accessibility testing for mobile and web applications. Focused on ensuring optimal functionality, usability, and compliance with accessibility standards while efficiently managing and tracking issues using Mantis Bug Tracker to facilitate timely defect resolution."
        ]
      },
      {
        "role": "QA Tester",
        "company": "Tensai - Internship",
        "date": "August 2021- December 2021",

        "description": [
          "Collaborated within the testers' team on projects for a truck tracking app and a shopping mall web application, working closely with developers to create, maintain, and execute functional test plans and cases for mobile and web applications. Ensured high quality and optimal user experience while effectively tracking and resolving bugs using Mantis Bug Tracker."
        ]
      }
    ]
  },

  "education": {
    "title": "Education",
    "info": [
      {
        "degree": "BS - Computer Science",
        "school": "UdelaR (FING) - CETP",
        "date": "2022"
      },

      {
        "degree": "BS - Psychology",
        "school": "UdelaR - Psychology Faculty",
        "date": "2014"
      }
    ]
  }
}
